[{
  "_id": 2,
  "titulo": "As vantagens de ser invisível",
  "capa": "https://s2-techtudo.glbimg.com/8IRLHOxBLxSznI9dM2mfKla722k=/1200x/smart/filters:cover():strip_icc()/i.s3.glbimg.com/v1/AUTH_08fbf48bc0524877943fe86e43087e7a/internal_photos/bs/2023/X/F/SsSXBsQ4GBjHAAPdgQBg/as-vantagens-de-ser-invisivel.html-.jpg",
  "descricao": "Um jovem tímido se esconde em seu próprio mundo até conhecer dois irmãos que o ajudam a viver novas experiências. Embora esteja feliz nessa nova fase, ele não esquece as tristezas do passado, que têm origem em uma chocante revelação.",
  "nota": 7.9,
  "fav": true
},
{
  "_id": 3,
  "titulo": "Frozen",
  "capa": "https://s2-techtudo.glbimg.com/LS-tBNkTeWnkvQnNaC0ssP_OVec=/0x0:708x398/888x0/smart/filters:strip_icc()/i.s3.glbimg.com/v1/AUTH_08fbf48bc0524877943fe86e43087e7a/internal_photos/bs/2023/C/n/k86YXBQRAZUARIoKJELQ/31-1.jpg",
  "descricao": "Acompanhada por um vendedor de gelo, a jovem e destemida princesa Anna parte em uma jornada por perigosas montanhas de gelo na esperança de encontrar sua irmã, a rainha Elsa, e acabar com a terrível maldição de inverno eterno, que está provocando o congelamento do reino.",
  "nota": 7.4,
  "fav": false
},
{
  "_id": 4,
  "titulo": "Black Swan",
  "capa": "https://m.media-amazon.com/images/S/pv-target-images/64768daa6daa38f8bf9ac98b683c07a2d660c396a94e3aeb013361e12a4e7df0.jpg",
  "descricao": "Nina Sayers é uma bailarina dedicada que busca a perfeição. Quando consegue o papel principal na produção O Lago dos Cisnes, ela precisa interpretar tanto o doce Cisne Branco quanto o sedutor Cisne Negro. À medida que a pressão aumenta, a obsessão de Nina com a perfeição começa a afetar sua mente, levando-a a um perigoso e sombrio colapso psicológico.",
  "nota": 8,
  "fav": true
},
{
  "_id": 5,
  "titulo": "Poor Things",
  "capa": "https://cdn.somaisumacoisa.com/wp-content/uploads/2024/01/poor-things-022_054_poorthings_ov_v30464704_fp_dpo_prohq_uhd-sdr_24_eng-166_eng-5120_a_ops9z8mjw_tiff53_rgb_wide-4d39fc138bbd4327b154fafa46431a90caf82678-s1400-c100.jpg",
  "descricao": "Bella Baxter é uma jovem trazida de volta à vida pelo brilhante, porém excêntrico, cientista Dr. Godwin Baxter. Sedenta por experiências, Bella foge com um advogado astuto para uma jornada ao redor do mundo. Livre dos padrões da sociedade, ela explora a libertação e o desejo, determinada a viver plenamente.",
  "nota": 8.3,
  "fav": false
},
{
  "_id": 6,
  "titulo": "Frozen 2",
  "capa": "https://prod-ripcut-delivery.disney-plus.net/v1/variant/disney/152142E50E3D7FF44065AC6FBF5C6478C844C075E0118351D19F90285FEA6C55/scale?width=1200&aspectRatio=1.78&format=webp",
  "descricao": "Elsa, Anna, Kristoff, Olaf e Sven embarcam em uma perigosa, mas notável jornada para descobrir a origem dos poderes mágicos de Elsa. Buscando respostas, o grupo viaja para além de Arendelle e encontra segredos antigos que ameaçam o reino. Elsa precisa enfrentar o desconhecido e entender seu verdadeiro destino.",
  "nota": 6.8,
  "fav": false
},
{
  "_id": 7,
  "titulo": "Como treinar seu dragão",
  "capa": "https://uploads.alternativanerd.com.br/wp-content/uploads/2023/11/AN_Como-Treinar-o-Seu-Dragao.jpg",
  "descricao": "Soluço é um jovem viking que vive em uma vila onde lutar contra dragões é um estilo de vida. Ao encontrar um Fúria da Noite, um dragão raro chamado Banguela, ele descobre que essas criaturas não são tão perigosas quanto parecem. Juntos, eles formam uma amizade improvável e desafiam tudo o que a vila acredita sobre dragões.",
  "nota": 8.1,
  "fav": true
},
{
  "_id": 8,
  "titulo": "Wall-E",
  "capa": "https://prod-ripcut-delivery.disney-plus.net/v1/variant/disney/5C8D13FFDEA93C10069A51DDA07050A362726ADCA060AACEE5DACB61CD3F7891/scale?width=1200&aspectRatio=1.78&format=webp",
  "descricao": "Num futuro distante, a Terra foi abandonada devido à poluição e ao acúmulo de lixo. Wall-E, um robô solitário encarregado de limpar o planeta, passa seus dias compactando resíduos e sonhando com amor. Sua vida muda completamente quando conhece EVA, um robô de alta tecnologia que busca sinais de vida no planeta. Juntos, eles embarcam em uma jornada que pode salvar a humanidade.",
  "nota": 8.4,
  "fav": false
},
{
  "_id": 9,
  "titulo": "De volta para o futuro",
  "capa": "https://www.sescsp.org.br/wp-content/uploads/2024/11/de-volta-para-o-futuro-capa.jpg",
  "descricao": "Marty McFly, um adolescente comum, é acidentalmente enviado de volta ao ano de 1955 em uma máquina do tempo construída pelo excêntrico cientista Dr. Emmett Brown. Ao interferir nos eventos do passado, Marty precisa garantir que seus pais se apaixonem para não apagar sua própria existência e, ao mesmo tempo, encontrar uma forma de voltar para o futuro.",
  "nota": 8.5,
  "fav": true
},
{
  "_id": 10,
  "titulo": "Ratatouille",
  "capa": "https://www.saboravida.com.br/wp-content/uploads/2017/06/filme-ratatouille.jpg.webp",
  "descricao": "Remy, um ratinho apaixonado por culinária, sonha em se tornar um grande chef, mesmo sabendo que os humanos odeiam roedores na cozinha. Em Paris, ele conhece Linguini, um jovem atrapalhado que trabalha em um restaurante renomado. Juntos, eles formam uma dupla improvável que prova que qualquer um pode cozinhar, independentemente das circunstâncias.",
  "nota": 8.1,
  "fav": false
},
{
  "_id": 11,
  "titulo": "A Viagem de Chihiro",
  "capa": "https://carlotas.org/bra/wp-content/uploads/2023/06/O-Filmei-1024x409.jpg",
  "descricao": "Chihiro, uma garota de 10 anos, acaba presa em um mundo mágico após entrar em um parque abandonado com seus pais, que são transformados em porcos. Trabalhando em uma casa de banhos para espíritos, ela precisa encontrar coragem e determinação para salvar sua família e retornar ao mundo real, enquanto enfrenta criaturas místicas e desafios surpreendentes.",
  "nota": 8.6,
  "fav": false
},
{
  "_id": 12,
  "titulo": "Mulher Maravilha",
  "capa": "https://universosagas.ig.com.br/wp-content/uploads/2024/03/steve-trevor-and-wonder-woman-in-2017-s-wonder-woman.png",
  "descricao": "Diana, princesa das Amazonas, é treinada para ser uma guerreira imbatível. Quando um piloto cai na ilha em que vive e conta sobre uma guerra devastadora no mundo exterior, Diana deixa seu lar, convencida de que pode acabar com o conflito. Lutando lado a lado com os homens na Primeira Guerra Mundial, ela descobre seu verdadeiro poder e propósito.",
  "nota": 7.4,
  "fav": true
},
{
  "_id": 13,
  "titulo": "Alice no país das maravilhas",
  "capa": "https://prod-ripcut-delivery.disney-plus.net/v1/variant/disney/F63C3AC9B644F2D8ACD0A72847310A3854F763BFE484C84493AB66AD8E55EB49/scale?width=1200&aspectRatio=1.78&format=webp",
  "descricao": "Em uma festa, Alice descobre um mundo mágico ao seguir um coelho branco. Lá, encontra criaturas fantásticas e descobre que é a única capaz de derrotar a terrível Rainha Vermelha para restaurar a paz no País das Maravilhas.",
  "nota": 6.4,
  "fav": true
},
{
  "_id": 14,
  "titulo": "Legalmente Loira",
  "capa": "https://rollingstone.com.br/media/uploads/reese-witherspoon-em-legalmente-loira_reproducao_twitter.jpg",
  "descricao": "Elle Woods é uma jovem estilosa que parece superficial, mas surpreende todos ao ingressar na prestigiada faculdade de direito de Harvard para reconquistar seu ex-namorado. Lá, ela prova que inteligência e determinação podem desafiar preconceitos e criar impacto.",
  "nota": 6.4,
  "fav": true
},
{
  "_id": 15,
  "titulo": "Sociedade dos poetas mortos",
  "capa": "https://prod-ripcut-delivery.disney-plus.net/v1/variant/disney/18279FDDBE420E39710ABA28A93D59FB1CAEC5C044E1670A69BB80466B2D3F1B/scale?width=1200&aspectRatio=1.78&format=webp",
  "descricao": "Em um colégio interno conservador, um professor de literatura inspira seus alunos a viverem suas vidas com paixão e a 'sugar a essência da vida', apresentando-lhes o poder da poesia. Suas lições impactam profundamente os jovens, levando-os a questionar normas e buscar seus sonhos.",
  "nota": 8.1,
  "fav": true
},
{
  "_id": 16,
  "titulo": "Castelo animado",
  "capa": "https://trecobox.com.br/wp-content/uploads/2024/07/trecobox.com.br-o-castelo-animado.jpg",
  "descricao": "A história segue Sophie, uma jovem que é transformada em uma idosa por uma bruxa. Ela busca ajuda de um misterioso castelo ambulante que é comandado por um mago chamado Howl. Juntos, enfrentam várias aventuras e, ao longo do caminho, lidam com questões de guerra e transformação.",
  "nota": 8.2,
  "fav": false
},
{
  "_id": 17,
  "titulo": "Gente grande",
  "capa": "https://rollingstone.com.br/media/_versions/cena-de-gente-grande_reproducao_twitter_widelg.jpg",
  "descricao": "Cinco amigos de infância se reúnem após a morte de seu treinador de basquete. Eles passam o fim de semana em uma casa de campo, relembrando os velhos tempos e revivendo a diversão de sua juventude, enquanto enfrentam as responsabilidades da vida adulta.",
  "nota": 6,
  "fav": false
},
{
  "_id": 18,
  "titulo": "As branquelas",
  "capa": "https://s2-extra.glbimg.com/Q8xsiEvxx7ZWAT8-uWOAXLQ_55o=/0x0:1280x720/888x0/smart/filters:strip_icc()/i.s3.glbimg.com/v1/AUTH_1f551ea7087a47f39ead75f64041559a/internal_photos/bs/2024/f/K/9gJZGSQjCS53Sn78Fd3g/3679610.jpg",
  "descricao": "Dois agentes do FBI, Kevin e Marcus, disfarçam-se de socialites loiras para proteger duas irmãs ricas, Brittany e Tiffany Wilson, de um sequestro. A situação vira uma comédia de erros enquanto eles tentam se passar por garotas da alta sociedade.",
  "nota": 6.1,
  "fav": false
},
{
  "_id": 19,
  "titulo": "Operação cupido",
  "capa": "https://recreio.com.br/media/uploads/disney/operacao_cupido_capa.jpg",
  "descricao": "Duas gêmeas idênticas, separadas na infância, se reencontram em um acampamento de verão e planejam reunir seus pais divorciados. O filme é uma comédia familiar com foco na reconciliação e união familiar.",
  "nota": 6.6,
  "fav": false
},
{
  "_id": 20,
  "titulo": "Grinch",
  "capa": "https://revista.meuretiro.com.br/wp-content/uploads/2021/12/grinch-1158x595-1-800x450.jpg",
  "descricao": "O Grinch, um ser rabugento que odeia o Natal, tenta destruir a celebração na cidade de Whoville. Contudo, ao interagir com a bondosa Cindy Lou Who, ele começa a questionar seus próprios sentimentos sobre a data.",
  "nota": 6.1,
  "fav": false
},
{
  "_id": 1,
  "titulo": "O diário de uma princesa",
  "capa": "https://prod-ripcut-delivery.disney-plus.net/v1/variant/disney/3CB224793086A2BDC7AB42C15303319D8140767868E5B6C06EC8459BC6DB40CD/scale?width=1200&aspectRatio=1.78&format=webp",
  "descricao": "Mia é uma garota de 15 anos que vive com sua mãe em São Francisco. De repente, ela descobre que seu pai é o Príncipe de Genóvia, um pequeno país europeu. Ela recebe a visita de sua avó recém-descoberta, que passa a lhe dar aulas de etiqueta, ensinando-a como uma princesa deve se portar. Mas quando se aproxima a data de seu aniversário, Mia precisa definir que caminho pretende tomar em sua vida: tornar-se uma princesa e se mudar para Genóvia ou permanecer morando com a mãe.",
  "nota": 6.4,
  "fav": false
},
{
  "_id": 21,
  "titulo": "Como Perder um Homem em 10 Dias",
  "capa": "https://ziipi.com/wp-content/uploads/2024/09/Como-Perder-um-Homem-em-10-Dias.jpg",
  "descricao": "Andie Anderson, uma jornalista de moda, escreve sobre relacionamentos e decide testar uma teoria sobre como fazer um homem terminar um relacionamento. Ela escolhe Ben Barry, um publicitário que aposta que pode fazer uma mulher se apaixonar por ele em 10 dias. O que começa como um jogo vira uma situação complicada à medida que eles começam a se envolver de verdade.",
  "nota": 6.7,
  "fav": false
},
{
  "_id": 25,
  "titulo": "10 Coisas que Eu Odeio em Você",
  "capa": "https://prod-ripcut-delivery.disney-plus.net/v1/variant/disney/16713D97ED1BED720A77CB615C4C7BEED0B17C3274F2244D6EECDBFDF635A699/scale?width=506&aspectRatio=2.00&format=webp",
  "descricao": "Uma moderna adaptação de 'A Megera Domada', de Shakespeare. A história segue Kat, uma jovem rebelde que não está interessada em namorar, até que um rapaz chamado Patrick é pago para se aproximar dela e fazê-la se apaixonar. No entanto, ele acaba se apaixonando por ela de verdade.",
  "nota": 7.3,
  "fav": false
},
{
  "_id": 22,
  "titulo": "La La Land: Cantando Estações",
  "capa": "https://m.media-amazon.com/images/S/pv-target-images/1bac0609a14b02b52d0cd91cbce9ffe2e593f3f8d39aa8fe05213553646ed582.jpg",
  "descricao": "Um musical que segue a história de Mia, uma aspirante a atriz, e Sebastian, um pianista de jazz, enquanto tentam seguir suas carreiras e sonhos em Los Angeles. Apesar de seu amor crescente, eles enfrentam desafios enquanto buscam sucesso em suas respectivas áreas.",
  "nota": 8,
  "fav": false
},
{
  "_id": 23,
  "titulo": "Como Eu Era Antes de Você",
  "capa": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEi8lL8IewGHfTWclfTK5xs4DiApzGoUitBT90DH4NqbhV4VzXStkmIPJdF1hs0rAmp_nr36CZJwtsX7th9eWnvxfGo2F29q4fA80i_ChsIoGRaTlA0_xWW9tLW9Z_QUzddD4Mr2iPhSzFAa/s1600/6-reasons-why-you-need-to-see-me-before-you-1012712.jpg",
  "descricao": "Louisa Clark é uma jovem mulher que se torna cuidadora de Will, um homem rico que ficou tetraplégico após um acidente. À medida que eles se aproximam, Louisa tenta mostrar a Will que a vida ainda pode valer a pena, apesar de suas limitações.",
  "nota": 7.4,
  "fav": true
},
{
  "_id": 24,
  "titulo": "Invocação do Mal",
  "capa": "https://pop.proddigital.com.br/wp-content/uploads/sites/8/2023/04/01-39.jpg",
  "descricao": "Baseado em eventos reais, o filme segue os investigadores paranormais Ed e Lorraine Warren enquanto ajudam uma família que está sendo aterrorizada por uma presença demoníaca em sua casa. O filme é conhecido por seu suspense e atmosfera de terror psicológico.",
  "nota": 7.5,
  "fav": false
}]